; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	image1 - mode
	spectrograph0 - mode
	GroundStation0 - direction
	Star1 - direction
	GroundStation2 - direction
	Star3 - direction
	GroundStation4 - direction
	Phenomenon5 - direction
	Star6 - direction
	Star7 - direction
	Star8 - direction
	Star9 - direction
	Planet10 - direction
	Planet11 - direction
	Star12 - direction
	Phenomenon13 - direction
	Planet14 - direction
	Planet15 - direction
	Planet16 - direction
)
(:init
	(supports instrument0 spectrograph0)
	(supports instrument0 image1)
	(calibration_target instrument0 Star3)
	(supports instrument1 image1)
	(calibration_target instrument1 GroundStation4)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star3)
)
(:goal (and
	(pointing satellite0 Phenomenon13)
	(have_image Phenomenon5 image1)
	(have_image Star6 image1)
	(have_image Star7 image1)
	(have_image Star8 image1)
	(have_image Star9 image1)
	(have_image Planet10 image1)
	(have_image Planet11 image1)
	(have_image Star12 spectrograph0)
	(have_image Phenomenon13 image1)
	(have_image Planet14 spectrograph0)
	(have_image Planet15 image1)
	(have_image Planet16 spectrograph0)
))

)

; plan
1. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 0 of 13
2. (calibrate satellite0 instrument0 star3)
   added: (calibrated instrument0)
   goals met: 0 of 13
3. (turn_to satellite0 planet14 star3)
   deleted: (pointing satellite0 star3)
   added: (pointing satellite0 planet14)
   goals met: 0 of 13
4. (take_image satellite0 planet14 instrument0 spectrograph0)
   added: (have_image planet14 spectrograph0)
   goals met: 1 of 13
5. (turn_to satellite0 planet11 planet14)
   deleted: (pointing satellite0 planet14)
   added: (pointing satellite0 planet11)
   goals met: 1 of 13
6. (take_image satellite0 planet11 instrument0 image1)
   added: (have_image planet11 image1)
   goals met: 2 of 13
7. (turn_to satellite0 planet10 planet11)
   deleted: (pointing satellite0 planet11)
   added: (pointing satellite0 planet10)
   goals met: 2 of 13
8. (take_image satellite0 planet10 instrument0 image1)
   added: (have_image planet10 image1)
   goals met: 3 of 13
9. (turn_to satellite0 phenomenon5 planet10)
   deleted: (pointing satellite0 planet10)
   added: (pointing satellite0 phenomenon5)
   goals met: 3 of 13
10. (take_image satellite0 phenomenon5 instrument0 image1)
   added: (have_image phenomenon5 image1)
   goals met: 4 of 13
11. (turn_to satellite0 planet15 phenomenon5)
   deleted: (pointing satellite0 phenomenon5)
   added: (pointing satellite0 planet15)
   goals met: 4 of 13
12. (take_image satellite0 planet15 instrument0 image1)
   added: (have_image planet15 image1)
   goals met: 5 of 13
13. (turn_to satellite0 planet16 planet15)
   deleted: (pointing satellite0 planet15)
   added: (pointing satellite0 planet16)
   goals met: 5 of 13
14. (take_image satellite0 planet16 instrument0 spectrograph0)
   added: (have_image planet16 spectrograph0)
   goals met: 6 of 13
15. (turn_to satellite0 star12 planet16)
   deleted: (pointing satellite0 planet16)
   added: (pointing satellite0 star12)
   goals met: 6 of 13
16. (take_image satellite0 star12 instrument0 spectrograph0)
   added: (have_image star12 spectrograph0)
   goals met: 7 of 13
17. (turn_to satellite0 star6 star12)
   deleted: (pointing satellite0 star12)
   added: (pointing satellite0 star6)
   goals met: 7 of 13
18. (take_image satellite0 star6 instrument0 image1)
   added: (have_image star6 image1)
   goals met: 8 of 13
19. (turn_to satellite0 star7 star6)
   deleted: (pointing satellite0 star6)
   added: (pointing satellite0 star7)
   goals met: 8 of 13
20. (take_image satellite0 star7 instrument0 image1)
   added: (have_image star7 image1)
   goals met: 9 of 13
21. (turn_to satellite0 star8 star7)
   deleted: (pointing satellite0 star7)
   added: (pointing satellite0 star8)
   goals met: 9 of 13
22. (take_image satellite0 star8 instrument0 image1)
   added: (have_image star8 image1)
   goals met: 10 of 13
23. (turn_to satellite0 star9 star8)
   deleted: (pointing satellite0 star8)
   added: (pointing satellite0 star9)
   goals met: 10 of 13
24. (take_image satellite0 star9 instrument0 image1)
   added: (have_image star9 image1)
   goals met: 11 of 13
25. (turn_to satellite0 phenomenon13 star9)
   deleted: (pointing satellite0 star9)
   added: (pointing satellite0 phenomenon13)
   goals met: 12 of 13
26. (take_image satellite0 phenomenon13 instrument0 image1)
   added: (have_image phenomenon13 image1)
   goals met: 13 of 13
